<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Scout Driver
    |--------------------------------------------------------------------------
    |
    | Поддерживаемые драйверы: "meilisearch", "algolia", "database".
    |
    */

    'driver' => env('SCOUT_DRIVER', 'meilisearch'),

    /*
    |--------------------------------------------------------------------------
    | Meilisearch Configuration
    |--------------------------------------------------------------------------
    |
    */

    'meilisearch' => [
        'host' => env('MEILISEARCH_HOST', 'http://127.0.0.1:7700'),
        'key' => env('MEILISEARCH_KEY', null),
    ],

    /*
    |--------------------------------------------------------------------------
    | Prefix (необязательно)
    |--------------------------------------------------------------------------
    |
    | Используется для добавления префикса к индексам.
    |
    */

    'prefix' => env('SCOUT_PREFIX', ''),

    /*
    |--------------------------------------------------------------------------
    | Queue Data Sync
    |--------------------------------------------------------------------------
    |
    | Включает асинхронное обновление индекса через очереди.
    |
    */

    'queue' => env('SCOUT_QUEUE', false),

];
